MDK-Packs/CB_Lab4Layer/project/Platform/FRDM-K32L3A6/RTE/Board_Support/K32L3A60VPJ1A_cm4/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins_cm4(void); /* Function assigned for the Cortex-M4F */

/*! @name PORTA0 (coord B10), BUTTON_NMI
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITBUTTONS_SW2_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITBUTTONS_SW2_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITBUTTONS_SW2_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBUTTONS_SW2_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITBUTTONS_SW2_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTE8 (coord P16), BUTTON_LLWUP23
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITBUTTONS_SW3_FGPIO FGPIOE             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITBUTTONS_SW3_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITBUTTONS_SW3_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITBUTTONS_SW3_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBUTTONS_SW3_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITBUTTONS_SW3_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTE9 (coord N16), BUTTON_LLWUP24
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITBUTTONS_SW4_FGPIO FGPIOE             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITBUTTONS_SW4_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITBUTTONS_SW4_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITBUTTONS_SW4_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBUTTONS_SW4_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITBUTTONS_SW4_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTE12 (coord L12), BUTTON_LLWUP26
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITBUTTONS_SW5_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITBUTTONS_SW5_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITBUTTONS_SW5_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITBUTTONS_SW5_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBUTTONS_SW5_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITBUTTONS_SW5_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitButtons(void); /* Function assigned for the Cortex-M4F */

/*! @name PORTA22 (coord B6), Q6[2]/LED_BLUE
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDS_RGB_BLUE_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDS_RGB_BLUE_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITLEDS_RGB_BLUE_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDS_RGB_BLUE_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDS_RGB_BLUE_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTA23 (coord E6), Q7[5]/LED_GREEN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDS_RGB_GREEN_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDS_RGB_GREEN_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITLEDS_RGB_GREEN_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDS_RGB_GREEN_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDS_RGB_GREEN_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORTA24 (coord D6), Q7[2]/LED_RED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDS_RGB_RED_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDS_RGB_RED_GPIO_PIN_MASK (1U << 24U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITLEDS_RGB_RED_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDS_RGB_RED_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDS_RGB_RED_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDs(void); /* Function assigned for the Cortex-M4F */

/*! @name PORTC8 (coord P3), U11[1]/K32L_UART0_TX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UART_DEBUG_UART0_TX_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UART_DEBUG_UART0_TX_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UART_DEBUG_UART0_TX_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                                     /* @} */

/*! @name PORTC7 (coord N2), U40[1]/K32L_UART0_RX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UART_DEBUG_UART0_RX_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UART_DEBUG_UART0_RX_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UART_DEBUG_UART0_RX_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UART(void); /* Function assigned for the Cortex-M4F */

/*! @name EXTAL32 (coord E16), Y1[1]/EXTAL_32KHZ
  @{ */
/* @} */

/*! @name XTAL32 (coord E17), Y1[2]/XTAL_32KHZ
  @{ */
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOSC(void); /* Function assigned for the Cortex-M4F */

/*! @name PORTE30 (coord G17), U14[4]/ACCEL_I2C3_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITACCEL_ACCEL_SCL_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITACCEL_ACCEL_SCL_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_INITACCEL_ACCEL_SCL_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTE29 (coord G15), U14[6]/ACCEL_I2C3_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITACCEL_ACCEL_SDA_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITACCEL_ACCEL_SDA_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_INITACCEL_ACCEL_SDA_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTE1 (coord R16), U14[11]/ACCEL_INT1
  @{ */

