MDK-Packs/CB_Lab4Layer/project/Platform/FRDM-K32L3A6/RTE/Board_Support/K32L3A60VPJ1A_cm4/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITACCEL_ACCEL_INT1_FGPIO FGPIOE             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITACCEL_ACCEL_INT1_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITACCEL_ACCEL_INT1_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITACCEL_ACCEL_INT1_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITACCEL_ACCEL_INT1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITACCEL_ACCEL_INT1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTE22 (coord J16), U14[9]/ACCEL_INT2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITACCEL_ACCEL_INT2_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITACCEL_ACCEL_INT2_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITACCEL_ACCEL_INT2_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITACCEL_ACCEL_INT2_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITACCEL_ACCEL_INT2_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITACCEL_ACCEL_INT2_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORTE27 (coord H14), U14[16]/ACCEL_RST
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITACCEL_ACCEL_RST_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITACCEL_ACCEL_RST_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITACCEL_ACCEL_RST_GPIO_PIN_MASK (1U << 27U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITACCEL_ACCEL_RST_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITACCEL_ACCEL_RST_PIN 27U                   /*!<@brief PORT pin number */
#define BOARD_INITACCEL_ACCEL_RST_PIN_MASK (1U << 27U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCEL(void); /* Function assigned for the Cortex-M4F */

/*! @name PORTB9 (coord F4), J4[6]/J47[2]/ARDUINO_A2/ADC0_SE3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLIGHT_SENSOR_SNS_LIGHT_ADC_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLIGHT_SENSOR_SNS_LIGHT_ADC_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITLIGHT_SENSOR_SNS_LIGHT_ADC_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLIGHT_SENSOR_SNS_LIGHT_ADC_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITLIGHT_SENSOR_SNS_LIGHT_ADC_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLIGHT_SENSOR(void); /* Function assigned for the Cortex-M4F */

/*! @name USB0_DM (coord T12), J8[2]/K32L_USB_DN
  @{ */
/* @} */

/*! @name USB0_DP (coord T11), J8[3]/K32L_USB_DP
  @{ */
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSB(void); /* Function assigned for the Cortex-M4F */

/*! @name PORTD11 (coord R11), J9[P1]/SDHC0_D2
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITSDHC_SDHC0_D2_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHC_SDHC0_D2_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHC_SDHC0_D2_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTD10 (coord P11), J9[P2]/SDHC0_D3
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITSDHC_SDHC0_D3_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHC_SDHC0_D3_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHC_SDHC0_D3_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTD9 (coord U11), J9[P3]/SDHC0_CMD
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITSDHC_SDHC0_CMD_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHC_SDHC0_CMD_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHC_SDHC0_CMD_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTD8 (coord T9), J9[P5]/SDHC0_DCLK
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITSDHC_SDHC0_DCLK_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHC_SDHC0_DCLK_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHC_SDHC0_DCLK_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORTD7 (coord P10), J9[P7]/SDHC0_D0
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITSDHC_SDHC0_D0_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHC_SDHC0_D0_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHC_SDHC0_D0_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTD6 (coord U9), J9[P8]/SDHC0_D1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITSDHC_SDHC0_D1_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHC_SDHC0_D1_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHC_SDHC0_D1_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTC27 (coord P6), J9[G1]/SD_DETECT
  @{ */

