MDK-Packs/CB_Lab4Layer/project/Platform/FRDM-K32L3A6/RTE/Board_Support/K32L3A60VPJ1A_cm4/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITSDHC_SD_DETECT_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITSDHC_SD_DETECT_GPIO_PIN_MASK (1U << 27U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITSDHC_SD_DETECT_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHC_SD_DETECT_PIN 27U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHC_SD_DETECT_PIN_MASK (1U << 27U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDHC(void); /* Function assigned for the Cortex-M4F */

/*! @name PORTA26 (coord A5), J1[4]/ARDUINO_D1_UART1_TX/UART1_TX_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITARDUINO_UART_ARDUINO_LPUART1_TX_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITARDUINO_UART_ARDUINO_LPUART1_TX_PIN 26U                   /*!<@brief PORT pin number */
#define BOARD_INITARDUINO_UART_ARDUINO_LPUART1_TX_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                                            /* @} */

/*! @name PORTA25 (coord B5), J1[2]/ARDUINO_D0_UART1_RX/UART1_RX_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITARDUINO_UART_ARDUINO_LPUART1_RX_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITARDUINO_UART_ARDUINO_LPUART1_RX_PIN 25U                   /*!<@brief PORT pin number */
#define BOARD_INITARDUINO_UART_ARDUINO_LPUART1_RX_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitARDUINO_UART(void); /* Function assigned for the Cortex-M4F */

/*! @name PORTB6 (coord E1), J2[6]/ARDUINO_D10/SPI0_PCS2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITARDUINO_SPI_ARDUINO_SPI_SSN_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITARDUINO_SPI_ARDUINO_SPI_SSN_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITARDUINO_SPI_ARDUINO_SPI_SSN_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITARDUINO_SPI_ARDUINO_SPI_SSN_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITARDUINO_SPI_ARDUINO_SPI_SSN_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name PORTB5 (coord D2), J2[8]/ARDUINO_D11/SPI0_SOUT
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITARDUINO_SPI_ARDUINO_SPI_MOSI_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITARDUINO_SPI_ARDUINO_SPI_MOSI_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITARDUINO_SPI_ARDUINO_SPI_MOSI_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                                        /* @} */

/*! @name PORTB7 (coord E2), J2[10]/ARDUINO_D12/SPI0_SIN
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITARDUINO_SPI_ARDUINO_SPI_MISO_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITARDUINO_SPI_ARDUINO_SPI_MISO_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITARDUINO_SPI_ARDUINO_SPI_MISO_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                                        /* @} */

/*! @name PORTB4 (coord C2), J2[12]/ARDUINO_D13/SPI0_SCK
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITARDUINO_SPI_ARDUINO_SPI_SCK_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITARDUINO_SPI_ARDUINO_SPI_SCK_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITARDUINO_SPI_ARDUINO_SPI_SCK_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitARDUINO_SPI(void); /* Function assigned for the Cortex-M4F */

/*! @name PORTB3 (coord C1), J2[4]/ARDUINO_D9/PWM
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ARDUINO_PTB3_ARDUINO_PTB3_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_ARDUINO_PTB3_ARDUINO_PTB3_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_ARDUINO_PTB3_ARDUINO_PTB3_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_ARDUINO_PTB3_ARDUINO_PTB3_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_ARDUINO_PTB3_ARDUINO_PTB3_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins_Arduino_PTB3(void); /* Function assigned for the Cortex-M4F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
